### Term 1 ###
print("Задание 1: Словарь из Двух Списков Одинаковой Длинны, 1 - Ключ, 2 - значение.")
color = ['red', 'green', 'blue']
hex_value = ['#FF0000', '#008000', '#0000FF']
dict_hex_value = dict(zip(color, hex_value))
print(dict_hex_value)
print()
print()

### Term 2 ###
print("Задание 2: Создать словарь из 9 Элементов key = key**3.")
dict_val_mul_three = {i: pow(i, 3) for i in range(1, 10)}
print(dict_val_mul_three)
print()
print()

### Term 3 ###
print("Задание 3: Из 2 Списков Данных Создать Новый Словарь Используя Генратор Словарей. ")

### Term 4 ###
print("Задание 4: Создать функцию минимального числа, произвольного количесива чисел")

### Term 5 ###
print("Задание 5: Найти сумму элементов, предыдущего значения с текущим, произвольного количества Элементов. ")